export default [
  { text: '🌔天文', link: '/天文' },
  { text: '🕠历法', link: '/历法' },
  { text: '🎵乐律', link: '/乐律' },
  { text: '🌏地理', link: '/地理' },
  {
    text: '👮职官', link: '/职官',
    children: [
      { text: '中央官制', link: '/职官/中央官制.md' },
      { text: '地方官制', link: '/职官/地方官制.md' },
      { text: '品阶勋爵', link: '/职官/品阶勋爵.md' },
    ],
  },
  { text: '👨‍🎓科举', link: '/科举' },
  { text: '🆔姓名', link: '/姓名' },
  {
    text: '💓礼俗', link: '/礼俗',
    children: [
      { text: '阶级、阶层', link: '/礼俗/阶级阶层.md' },
      { text: '冠礼', link: '/礼俗/冠礼.md' },
      { text: '婚姻', link: '/礼俗/婚姻.md' },
      { text: '丧葬', link: '/礼俗/丧葬.md' }
    ],
  },
  {
    text: '👨‍👩‍👧‍👦宗法', link: '/宗法',
    children: [
      { text: '族、昭、穆', link: '/宗法/族昭穆.md' },
      { text: '大宗、小宗', link: '/宗法/大宗小宗.md' },
      { text: '亲属', link: '/宗法/亲属.md' },
      { text: '丧服', link: '/宗法/丧服.md' },
    ],
  },
  { text: '🛖宫室', link: '/宫室'},
  { text: '🐴车马', link: '/车马'},
  { text: '🍜饮食', link: '/饮食'},
  { text: '👜衣饰', link: '/衣饰'},
  { text: '🛠️什物', link: '/什物' },
]